In [3]:
import  pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("Serires \n",series)
print(type(series))

Serires
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
## Create a series from dictionary 
data = {'a':1,'b':2,'c': 3}
series = pd.Series(data)
print("Series\n",series)

Series
 a    1
b    2
c    3
dtype: int64

In [ ]:
data =[10,20,30]
index = ['a','b','c']
pd.Series(data,index = index)

a    10
b    20
c    30
dtype: int64

In [ ]:
# Dataframe 
## create a dataframe from a dictionary of list

data ={
    'name':['krish','Vedant','nitesh'],
    'Age':[30,23,24],
    'city':['Bombay','Paprola','chandrbhaga']
} 

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age         city
0   krish   30       Bombay
1  Vedant   23      Paprola
2  nitesh   24  chandrbhaga
<class 'pandas.core.frame.DataFrame'>

In [35]:
## create a dataframe from list of dictionaries

data =[
        {'Name':'Krish','Age':32,'City':'Bomabay'},
        {'Name':'Vedant','Age':23,'City':'Paprola'},
        {'Name':'Nitesh','Age':23,'City':'Chandrbhaga'}
]

df = pd.DataFrame(data)

print(df)

     Name  Age         City
0   Krish   32      Bomabay
1  Vedant   23      Paprola
2  Nitesh   23  Chandrbhaga

In [34]:
df1 = pd.read_csv('sales_data.csv')
df1.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [33]:
df1.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [36]:
df

     Name  Age         City
0   Krish   32      Bomabay
1  Vedant   23      Paprola
2  Nitesh   23  Chandrbhaga

In [37]:
df['Name']
type(df['Name'])

pandas.core.series.Series

In [38]:
df.loc[0] ## this pick up 0th row of dataframe

Name      Krish
Age          32
City    Bomabay
Name: 0, dtype: object

In [39]:
df.loc[0][0]

C:\Users\Asus\AppData\Local\Temp\ipykernel_16556\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Krish'

In [42]:
# Accessing a specified element 
df.at[2,'Age']

np.int64(23)

In [ ]:
df.at[2,'Name']

'Nitesh'

In [44]:
## Accessing specified element using Iat

df.iat[2,2]

'Chandrbhaga'

In [45]:
### Data manipulation with data frames 
df

     Name  Age         City
0   Krish   32      Bomabay
1  Vedant   23      Paprola
2  Nitesh   23  Chandrbhaga

In [46]:
df['Salary'] = [50000,40000,30000]
df

     Name  Age         City  Salary
0   Krish   32      Bomabay   50000
1  Vedant   23      Paprola   40000
2  Nitesh   23  Chandrbhaga   30000

In [ ]:
## Remove a column
df.drop('Salary',axis=1)  ## axis = 0 will check rows &&  axis = 1 will check columns 

## If you drop a column like this then it is not permanent as you can see below 
# salary is still present in the data frame

     Name  Age         City
0   Krish   32      Bomabay
1  Vedant   23      Paprola
2  Nitesh   23  Chandrbhaga

In [55]:
df

     Name  Age         City  Salary
0   Krish   32      Bomabay   50000
1  Vedant   23      Paprola   40000
2  Nitesh   23  Chandrbhaga   30000

In [ ]:
df.drop('Salary',axis = 1,inplace=True) ## now using this salary is removed from dataframe also

In [57]:
df

     Name  Age         City
0   Krish   32      Bomabay
1  Vedant   23      Paprola
2  Nitesh   23  Chandrbhaga

In [59]:
## Add age to the column
df['Age'] = df['Age']+1
df

     Name  Age         City
0   Krish   34      Bomabay
1  Vedant   25      Paprola
2  Nitesh   25  Chandrbhaga

In [60]:
df.drop(0)

     Name  Age         City
1  Vedant   25      Paprola
2  Nitesh   25  Chandrbhaga

In [62]:
## Display the data types of each column

df1.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [63]:
## Describe the dataframe 
df1.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000